Autodesk.Revit.DB.Mechanical.FlexDuct.IsHVACSystemTypeId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Checks if given type is valid HVAC system type.
document:
The document.
systemTypeId:
ElementId of the HVAC system type to check.
Returns:
True if the given systemTypeId is the HVAC system type, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Mechanical.FlexDuct.IsFlexDuctTypeId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Checks if given type is valid flexible duct type.
Remarks:
A type is valid for flexible duct if it can be used to the flexible duct element.
document:
The document.
ductTypeId:
ElementId of the flexible duct type to check.
Returns:
True if flexible duct type can used for this duct, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Mechanical.FlexDuct.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Creates a new flexible duct into the document, using a point array and flexible duct type.
document:
The document.
systemTypeId:
The id of the HVAC system type.
ductTypeId:
The id of the flexible duct.
levelId:
The level id for the flexible duct.
startTangent:
The tangent vector at the start of the curve. The invalid or zero vector is ignored.
endTangent:
The tangent vector at the end of the curve. The invalid or zero vector is ignored.
points:
The point array indicating the path of the flexible duct, including the end point.
Returns:
If creation was successful then a new flexible duct is returned, otherwise an exception with failure information will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The systemTypeId is not valid HVAC system type.
-or-
The type ductTypeId is not valid flexible duct type.
-or-
The ElementId levelId is not a Level.
-or-
The valid number of points is less than two. In order to create a flex curve, at least two points are required. Note the duplicate points don't take into account.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2014

Autodesk.Revit.DB.Mechanical.FlexDuct.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Creates a new flexible duct into the document, using a point array and flexible duct type.
document:
The document.
systemTypeId:
The id of the HVAC system type.
ductTypeId:
The id of the flexible duct.
levelId:
The level id for the flexible duct.
points:
The point array indicating the path of the flexible duct, including the end point.
Returns:
If creation was successful then a new flexible duct is returned, otherwise an exception with failure information will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The systemTypeId is not valid HVAC system type.
-or-
The type ductTypeId is not valid flexible duct type.
-or-
The ElementId levelId is not a Level.
-or-
The valid number of points is less than two. In order to create a flex curve, at least two points are required. Note the duplicate points don't take into account.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2014

Autodesk.Revit.DB.Mechanical.FlexDuct.EndTangent
Gets or sets the tangent vector at the end of the curve. The invalid or zero vector is ignored when setting the tangent.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Mechanical.FlexDuct.StartTangent
Gets or sets the tangent vector at the start of the curve. The invalid or zero vector is ignored when setting the tangent.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014